//Интро
var lyrics1 = '| Мне нужны руки только мне нужны руки только  |' +
'И чтобы с тачек с окон типа рубили наши басы плотно наши басы  |' +
'Мама любит деньги любит деньги маму любят дети еее  |' +
'Они так хотят конфеты и их так хотят конфеты  |' +
'Конфеты в шубах под самодельный саунд  |' +
'Давай двигай с нами иии без правил  |' +
'Никто мне под сценой не кричит типа Красава  |' +
'Я вызываю тебя на следующий раунд  |' +
'Мы типа грибы типа грибы еее  |' +
'Поднялась влага в клубе и мы растем  |' +
'Поднимаем уровень  |' +
'Скажи мне что с тобой что с тобой  |' +
'А че ты вялая давай иди со мной я буду тебя баловать |' +
'Бал танцы утро ночь утро дождь |' +
'Бал танцы утро ночь утро дождь |' +
'Мы типа грибы мы типа грибы еее |' +
'Поднялась влага в клубе и мы растем |' +
'Мы тебя научим |' +
'Шевелить булки и работать правильно жопой |' +
'И в не далеком будущем ты будешь летать как будто бы Джордан |' +
'Стопудово выше чем башни Парижа |' +
'Это грибы хата Ориджинал |' +
'Надевай спортивные штанишки |' +
'Будем работать над твоим имиджем |' +
'Тут руки подымаются над головой вверх |' +
'Это наша банда запоминай момент |' +
'Естественно воспринимай все буквально |' +
'Нам ядерный Бум предсказывала Ванга |' +
'Давай музыка громче |' +
'Затресем весь движ этой ночью |' +
'Дома не сиди это грибы на CD |' +
'Впитывай то что мы тут говорим |' +
'Ну давай ди джей давай ди джей |' +
'Ну давай ди джей давай ди джей |';

//Велик
var lyrics2 = '| Мне не надо твой номер ты сама мне позвонишь |' +
'Я готовлю контрольный когда ты мне не готовишь |' +
'Весь мой день это встречи весь твой день это вещи |' +
'Весь твой день это вечер весь твой день это вельчик |' +
'Я меняю костюмы дую типа муссоны |' +
'Прилетаю повсюду все ради музона |' +
'Я не в себе два колеса одно тебе другое мне |' +
'Велосипед давай висеть у нас все есть |' +
'Два колеса одно тебе другое мне |' +
'Велосипед давай висеть |' +
'Среди всех иномарок ты мое украшение |' +
'Я тебе не подарок |' +
'У тебя не День Рождения |' +
'Я на медленном у нас low ride |' +
'Моя бейби бомба любит взрывать |' +
'Чики пики дела в танце трутся наши тела |' +
'Пару дней нам не спится|' +
'И я даже не помню где этот бит взял |' +
'Давай двигаться как ниндзя |' +
'Кстати тебе надо ходить в зал |' +
'Чтобы добиться |' +
'Ты не понимаешь как от меня отойти |' +
'Я же тебе не Джек Дениэлс |' +
'В голове до сих пор играет клубный Deep |' +
'Мы давно так не джемились |' +
'А давай будем джемиться |' +
'После того как поженимся |' +
'А давай будем джемиться |' +
'После того как поженимся |' +
'Все что тебе нужно сейчас это деньги |' +
'Все что мне нужно сейчас это день |' +
'Но ты как не крути мы летаем по встречной |' +
'Топим педали навстречу судьбе |' +
'Ты такая номинированная на успех |' +
'И мы будто на ракете подымаемся вверх |' +
'Мой каждый день это как новый фильм |' +
'Твой каждый день это погоня за ним' +
'Два колеса велосипед топим педалями только наверх |' +
'У нас все есть абонемент |' +
'Мы будто на ракете подымаемся вверх |' +
'Два колеса велосипед топим педалями только наверх |' +
'У нас все есть абонемент |' +
'Мы будто на ракете подымаемся вверх |' +
'Я не в себе два колеса одно тебе другое мне |' +
'Велосипед давай висеть у нас все есть |' +
'Два колеса одно тебе другое мне |' +
'Велосипед давай висеть |' +
'Она меня гладит потому что похож на кота |' +
'Вечерами по городу любя меня катает |' +
'Мы набираем скорость чтобы было быстрей |' +
'Я беру трехколесный чтобы ты была с ней |' +
'И мы катим тут и твоя подруга |' +
'Через черный вход обходим очередь у клуба |' +
'Бомба меня волнует только твои формы |' +
'Вот это да мама папа я не буду ночевать дома |' +
'У меня все ок миллион знакомых что не знают закон |' +
'Я не ухожу но пока пока |' +
'А ты липнешь ко мне как бабл гам |' +
'Я в твоем Audi и ты таешь на мне как Баунти |' +
'Ты в моем Audi и я таю на тебе как в Баунти |' +
'Ну давай без всяких|' +
'Не гони |' +
'Не гони так гнать' +
'Не гони |' +
'Не гони так гнать' +
'Не гони |' +
'Не гони так гнать |';

//Тает лед
var lyrics3 = '| Закрой глаза все постепенно и тебя тут никто не заменит |' +
'Утро подарит нам это мгновение и холода за окном не помеха |' +
'Пока мы здесь в теплой постели волосы волнами по твоей шее |' +
'Касания трепетны и безмятежны мы видимо нашли то что долго хотели |' +
'Здесь нас не найдут проблемы только ты и я в этом мире |' +
'Время застынет на этом моменте все что имею я отдам тебе |' +
'Пальцы сжимаются крепко крепко это все что нужно мне |' +
'Готов убежать за тобой на край света чтобы еще раз по новому все повторить |' +
'Между нами тает лед пусть теперь нас никто не найдет |' +
'Мы промокнем под дождем и сегодня мы только вдвоем |' +
'Между нами тает лед пусть теперь нас никто не найдет |' +
'Мы промокнем под дождем и сегодня мы только вдвоем |' +
'Между нами тает лед пусть теперь нас никто не найдет |' +
'Мы промокнем под дождем и сегодня мы только вдвоем |' +
'Между нами тает лед пусть теперь нас никто не найдет |' +
'Мы промокнем под дождем и сегодня мы только вдвоем |' +
'Снова голос твой он как будто колыбель |' +
'Я обниму тебя чтобы не стало холодней |' +
'Курточка моя так хорошо сидит на ней |' +
'А твои глаза как блики в играх NBA |' +
'Я делаю навстречу к тебе шаг чтобы от всех с тобой убежать |' +
'Под нашими ногами земной шар между нами сегодня пожар |' +
'Наплевать что вокруг метель с поцелуями как будто карамель |' +
'Температура как в жарком Акапулько между нами теперь ' +
'Ночь с тобой это значит что мы не будем спать |' +
'Беру тебя и профессионально иду гулять |' +
'Я надену свой костюм тебе так нравится велюр' +
'Ты нашла злого Юру среди самых лучших Юр |' +
'Я устраиваю рамс ты ставишь шах и мат |' +
'И даже и не знаешь что наш сын не любит шоколад |' +
'Он как медведь руками поедает сладкий мед |' +
'Мы смотрим на него и между нами тает лед |' +
'Между нами тает лед пусть теперь нас никто не найдет |' +
'Мы промокнем под дождем и сегодня мы только вдвоем |' +
'Между нами тает лед пусть теперь нас никто не найдет |' +
'Мы промокнем под дождем и сегодня мы только вдвоем |' +
'Только вдвоем только вдвоем мы только вдвоем |' +
'Только вдвоем мы только вдвоем мы здесь только вдвоем |';

//Копы
var lyrics4 ='| Среди старых кварталов нас ищут копы |' +
'Это каменный город где все по дефолту |' +
'Наш звук называй самым низкочастотным |' +
'Тут в приоритете снести твою голову |' +
'С плеч |' +
'Ненавидят соседи нас пока на битах зашкаливает приторный бас |' +
'Это принципиально нету времени спать |' +
'Руки в воздух летят только здесь и сейчас |' +
'Не перебивай Не перебивай |' +
'Пусть стены дрожат и трещат по швам |' +
'Это back in the days где тебе в самый раз |' +
'Нас ненавидят копы |' +
'Значит мы наваливаем бас копы так не любят нас |' +
'Не любят нас |' +
'Мы наваливаем бас копы так не любят нас |' +
'Не любят нас |' +
'Мы никому не даем спать |' +
'Мы наваливаем |' +
'Наш shit в ушах у копов трещит |' +
'Это вкусно как для укропа борщи |' +
'Это быстро как для блогера 3g |' +
'Это слишком высоко как для гнома джип |' +
'Держи |' +
'Не кидай нас на этажи |' +
'Мы спасение для лузера как будто бы джин|' +
'это grebz Это grebz |' +
'Мы растем |' +
'У нас тут снова дожди копы так не любят нас|' +
'Не любят нас |' +
'Под ногами ломаем паркет |' +
'Пока к нам копы ломятся в дверь |' +
'Здесь самый самый темный свет фонарей |' +
'Здесь самый самый громкий звук для людей |' +
'Для людей |' +
'Мало места мне нужен воздух и бас |' +
'Чтобы подорвать все как в последний раз |' +
'Здесь не видно глаз здесь не видно глаз |' +
'Нас ненавидят копы значит |' +
'Мы наваливаем бас копы так не любят нас |' +
'Мы наваливаем бас копы так не любят нас |' +
'Не любят нас |' +
'Мы наваливаем бас |';

function getLineOfSong(text, position) {
    letters = text.split('');
    start = position;
    end = position;

    //get beginning of line
    for (i = position; i >= 0; i--) {
        if (letters[i] === "|") {
            start = i;
            break;
        }
    }
    //get end of line
    for (j = position; i < text.length; j++) {
        if (letters[j] === "|") {
            end = j;
            break;
        }
    }

    //cut the result
    return String("'" + text.substring(start, end).replace("|", " ").trim() + "'...");
}

function filterLyricsQuery(text) {
    text = text.replace("ё", "е");
    text = text.replace(".", "");
    text = text.replace(",", "");
    text = text.replace("?", "");
    text = text.replace("!", "");
    return text;
}
